Revit 2027 API
ParameterTypeId.ColumnTopAttachCutParam Property
 "Top Attachment Cut"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ColumnTopAttachCutParam { get; }
Public Shared ReadOnly Property ColumnTopAttachCutParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ColumnTopAttachCutParam {
	ForgeTypeId^ get ();
}
static member ColumnTopAttachCutParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace